// Задание 1. Создайте переменную a. Запишите в нее значение 10, выведите его на экран с помощью метода alert(). Затем запишите в нее же значение 20, выведите его на экран.

 let a = 20;
 alert(a);

 // Задание 2. Создайте переменную и присвойте ей значение года выпуска первого iPhone. Выведите значение переменной на экран.

 const year = 2007;
 alert(year);

  // Задание 3. Создайте переменную и присвойте ей значение имени создателя языка JavaScript. Выведите значение переменной на экран.

  const userName = 'Steve Jobs';
  alert(userName);

  // Задание 4. Создайте две переменные: 10 и 2. С помощью метода alert() выведите на экран их сумму, разность, произведение и частное (результат деления).

  let x = 10;
  let y = 2;
  alert(x + y);
  alert(x - y);
  alert(x * y);
  alert(x / y);